Repository: DjMorgul/DRT
Catalog: locale/*/LC_MESSAGES/drt.po
Languages: es, pt

source: usage:
es: Uso:
pt: Uso:

source: positional arguments
es: parámetros posicionales
pt: argumentos posicionais

source: optional arguments
es: parámetros opcionales
pt: argumentos opcionais

source: show this help message and exit
es: mostrar esta ayuda y terminar
pt: mostrar esta mensagem de ajuda e sair

source: show program's version number and exit
es: mostrar la versión del programa y terminar
pt: mostrar a versão do programa e sair

source: unrecognized arguments: %s
es: parámetros desconocidos: %s
pt: argumentos não reconhecidos: %s

source: ignored explicit argument %r
es: ignorado parámetro explícito %r
pt: argumento explícito ignorado %r

source: too few arguments
es: faltan parámetros
pt: número de argumentos insuficiente

source: expected one argument
es: se esperaba un parámetro
pt: esperado um argumento

source: invalid %s value: %r
es: valor de tipo %s inválido: %r
pt: valor inválido de %s: %r

source: the following arguments are required: %s
es: se necesitan los siguientes parámetros: %s

source: invalid %(type)s value: %(value)r
es: valor de tipo %(type)s inválido: %(value)r
pt: valor de %(type)s inválido: %(value)r

source: With maximum abbreviation length %(maxAbrev)d, length of texts after compression: %(longDespues)d.
es: Con longitud máxima de las abreviaturas %(maxAbrev)d, longitud de cadenas tras abreviar: %(longDespues)d.
pt: Com o número máximo de abreviações %(maxAbrev)d, comprimento dos textos depois da compressão: %(longDespues)d.

source: disable compatibility with original interpreters
es: deshabilitar compatibilidad con intérpretes originales

source: MIN_LENGTH
es: LONG_MIN

source: minimum abbreviation length (default: %(default)d)
es: longitud mínima de abreviaturas (por defecto: %(default)d)
pt: tamanho mínimo da abreviatura (default: %(default)d)

source: MAX_LENGTH
es: LONG_MAX

source: maximum abbreviation length (default: %(default)d)
es: longitud máxima de abreviaturas (por defecto: %(default)d)
pt: tamanho máximo da abreviatura (default: %(default)d)

source: SUPERSET_LIMIT
es: LIMITE

source: limit for the superset search heuristic (default: %(default)d)
es: límite para heurística de búsqueda de superconjuntos (por defecto: %(default)d)

source: show additional information
es: mostrar información adicional
pt: mostrar informações adicionais

source: input.json
es: entrada.json

source: input filename, JSON database generated by DRC frontend
es: nombre del fichero de entrada, base de datos JSON generada por el frontend de DRC
pt: arquivo de entrada, banco de dados JSON gerado pelo compilador DRC

source: output.tok
es: salida.tok

source: output filename, for the best tokens found
es: nombre del fichero de salida, para las mejores abreviaturas encontradas
pt: arquivo de saída, para os melhores tokens encontrados

source: Length of texts without compression (excluding objects):
es: Longitud de los textos sin abreviar (excluyendo objetos):
pt: Tamanho dos textos sem compressão (excluindo objetos):

source: bytes saved from text compression
es: bytes ahorrados por abreviación de textos
pt: bytes recuperados da compressão de texto

source: The best combination of abbreviations was found with maximum abbreviation length
es: La mejor combinación de abreviaturas se encontró con longitud máxima de abreviatura
pt: A melhor combinação de abreviaturas foi encontrada com o comprimento máximo

source: abbreviations in total, which are:
es: abreviaturas en total, que son:
pt: abreviaturas no total, que são:

source: Error converting abbreviation %(abreviatura)s: it has %(cuenta)d characters that exceed code 127, but aren't on daad_a_chr
es: Error al convertir la abreviatura %(abreviatura)s: tiene %(cuenta)d caracteres que exceden el código 127, pero no salen en daad_a_chr
pt: Erro ao converter abreviatura %(abreviatura)s: ela tem %(cuenta)d caracteres que excedem o código 127, mas não estão no daad_a_chr

source: Abbreviations stored in:
es: Abreviaturas guardadas en:
pt: Abreviaturas armazenadas em:

source: %s: error: %s
pt: %s: erro: %s

source: %(prog)s: error: %(message)s
pt: %(prog)s: erro: %(message)s
